Repository: gzwplato/zreport
Catalog: source/languages/zrconst.*.po
Languages: pl

source: Band %s contains labels. Delete ?
pl: Wstęga %s zawiera etykiety. Usunąć ?

source: False
pl: Fałsz

source: True
pl: Prawda

source: Error evaluating '%s': %s
pl: Błąd przy obliczaniu wyrażenia '%s': %s

source: Cancel
pl: Anuluj

source: Circular links not allowed
pl: Zapętlone połączenia są niedozwolone

source: Illegal circular reference to '%s'
pl: Niepoprawne wywołanie rekurencyjne '%s'

source: complete
pl: wykonano

source: Controller variables '%s'
pl: Zmienne kontrolera '%s'

source: Convert code page
pl: Konwertuj stronę kodową

# zrconst.szrdesignacbandsdelete
source: Delete
pl: Usuń

# zrconst.szrdesignacbandsnew
source: Controller
pl: Kontroler

source: Rename
pl: Zmień nazwę

# zrconst.szrdesignacgroupsdelete
source: Delete
pl: Usuń

source: New
pl: Nowy

# zrconst.szrdesignacvariablesdelete
source: Delete
pl: Usuń

source: Expression
pl: Wyrażenie

source: Field
pl: Pole

source: Aggregate
pl: Agregacja

# zrconst.szrdesigncellcontroller
source: Controller
pl: Kontroler

source: Data
pl: Dane

source: &Close
pl: &Zamknij

source: Bands
pl: Wstęgi

source: Controllers
pl: Kontrolery

source: Groups
pl: Grupy

# zrconst.szrdesigngbvariables
source: Variables
pl: Zmienne

source: |Report controllers list
pl: |Lista kontrolerów raportu

# zrconst.szrdesignladatafields
source: Fields
pl: Pola

source: Expressions
pl: Wyrażenia

# zrconst.szrdesignlavariablefields
source: Fields
pl: Pola

source: Aggregates
pl: Agregacja

source: |List of fields available
pl: |Lista dostępnych pól

source: |Groups of the current report level
pl: |Grupy raportu z bieżącego poziomu

source: |List of expression variables
pl: |Lista wyrażeń

source: |List of data field variables
pl: |Lista zmiennych dla pól

source: |List of aggregate variables
pl: |Lista agregowanych zmiennych

# zrconst.szrdesignnone
source: <none>
pl: <brak>

source: Delete panel %s. Are you sure?
pl: Usunięcie wstęgi %s. Jesteś pewien?

source: Delete group %s. Are you sure?
pl: Usunięcie grupy %s. Jesteś pewien?

source: Bands and groups
pl: Wstęgi i grupy

# zrconst.szrdesigntsvars
source: Variables
pl: Zmienne

source: |Report bands
pl: |Wstęgi raportu

source: ESC-sequence
pl: Sekwencja znaków sterujących

source: <custom>
pl: <inny>

# zrconst.szrescapemodelnone
source: <none>
pl: <brak>

source: E&xit
pl: &Wyjście

source: Error in expression '%s'
pl: Niepoprawne wyrażenie '%s'

source: Expression '%s' not yet parsed
pl: Wyrażenie '%s' nie zostało zinterpretowane

source: Text files (*.txt)|*.txt|All files (*.*)|*.*
pl: Pliki tekstowe (*.txt)|*.txt|Wszystkie pliki (*.*)|*.*

source: First page
pl: Pierwsza strona

source: Go to page
pl: Strona

source: Ignore font styles
pl: Ignoruj styl czcionek

source: Wrong number of arguments for '%s'
pl: Niepoprawna ilość argumentów dla '%s'

source: Bitwise operation should have integer operands
pl: Operacje na bitach powinny mieć liczbowe operatory

source: Invalid usage of '%s' in expression '%s'
pl: Niepoprawne użycie '%s' w wyrażeniu '%s'

source: Invalid date operation
pl: Niepoprawna operacja na dacie

source: Logical operation should have boolean operands
pl: Operacje logiczne powinny mieć logiczne operatory

source: Invalid page range: %d..%d
pl: Niepoprawny zakres stron: %d..%d

source: Invalid unary '%s' in expression '%s'
pl: Niepoprawny operator unarny '%s' w wyrażeniu '%s'

source: Invalid date in expression '%s'
pl: Niepoprawna data w wyrażeniu '%s'

source: Invalid file name: %s
pl: Niepoprawna nazwa pliku: %s

source: Invalid numeric in expresison '%s'
pl: Niepoprawna liczba w wyrażeniu '%s'

source: Invalid string in expression '%s'
pl: Niepoprawny ciąg znaków w wyrażeniu '%s'

source: Last page
pl: Ostatnia strona

source: Load report
pl: Wczytaj raport

source: Closing '%s' missing in expression '%s'
pl: Brak zamknięcia '%s' w wyrażeniu '%s'

source: Next page
pl: Następna strona

source: Bands of %s type cannot have children
pl: Wstęga typu %s nie może posiadać potomków

source: Bands of %s type cannot have subcontrollers
pl: Wstęga typu %s nie może posiadać podkontrolek

source: %s band cannot stretch
pl: Wstęga %s nie może być rozciągana

source: of
pl: z

source: Go to page by number
pl: Przejdź do strony o numerze

source: Page
pl: Str.

source: A component of class %s can only belong to report bands
pl: Komponent klasy %s można umieścić tylko na wstędze

source: A component of class %s can only belong to report or report bands
pl: Komponent klasy %s można umieścić tylko na raporcie lub na wstędze

source: Previous page
pl: Poprzednia strona

# zrconst.szrprintdialogcaption
source: Printer setup
pl: Ustawienia drukarki

source: Copies
pl: Kopie

source: Code page
pl: Strona kodowa

source: Number of copies
pl: Liczba kopii

source: Options
pl: Opcje

source: Paper tpe
pl: Rodzaj papieru

source: Continuos
pl: Ciągły

source: Printer
pl: Drukarka

source: Print range
pl: Zakres wydruku

source: Print to file
pl: Drukuj do pliku

source: Sheet
pl: Arkusz

source: All pages
pl: Wszystkie strony

source: from:
pl: od:

source: Pages
pl: Strony

source: to:
pl: do:

source: Setup
pl: Ustawienia

source: New document not started
pl: Nie zaczęto nowego dokumentu

source: Report generating cancelled
pl: Generowanie raportu zostało przerwane

source: Not ready to start new document
pl: Drukarka nie jest gotowa

source: Out of page bounds, page %d/%d, line %d
pl: Poza zakresem strony, strona %d/%d, linia %d

# zrconst.szrprintersetup
source: Printer setup
pl: Ustawienia drukarki

source: Printing..
pl: Drukowanie...

source: Print
pl: Wydruk

source: Print report - Ctrl+P
pl: Drukuj raport - Ctrl+P

source: Processing..
pl: Przetwarzanie...

source: Count
pl: rek.

source: Title
pl: Nagłówek

source: Save report - Ctrl+S
pl: Zapisz raport - Ctrl+S

source: Search text
pl: Szukaj tekstu

source: &Continue
pl: Szukaj &następne

source: &From current position
pl: Szukaj od &bieżącej pozycji

source: Case &sensitive
pl: &Uwzględniaj wielkość liter

source: &Text to search
pl: Szukany &tekst

source: &Find
pl: &Szukaj

source: Search - F7, Continue - Shift+F7
pl: Szukaj - F7, Szukaj następne - Shift+F7

source: Search string '%s' not found
pl: Nie znaleziono wyrażenia '%s'

source: Search
pl: Szukaj

source: Unknown function or variable in expression '%s'
pl: Nieznana funkcja lub zmienna w wyrażeniu '%s'
